Revit 2024 API
Transform2D.SetToIdentity Method
 Set this TrfUV to the identity transform.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform2D SetToIdentity()
Visual Basic
Public Function SetToIdentity As Transform2D
Visual C++
public:
Transform2D^ SetToIdentity()
Return Value
 Returns a pointer to "this" Transform2D.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace